#ตัวดำเนินการเปรียบเทียบ

#เอาข้อมูล 2 ค่ามาเปรียบเทียบกัน
#ต้องเป็นชนิดข้อมูลเดียวกัน
#คำตอบจะมี 2 คำตอบ คือ True Fasle

"""
1.) > มากกว่า
2.) < น้อยกว่า
3.) == เท่ากับ
4.) != ไม่เท่ากับ
5.) >= มากกว่าหรือเท่ากับ
6.) <= น้อยกว่าหรือเท่ากับ
"""

x,y,z = 10,7,5

print("ค่า x มากกว่า y หรือไม่ :",x > y)
print("ค่า x น้อยกว่า y หรือไม่ :",x < y)
print("ค่า x เท่ากับกว่า y หรือไม่ :",x == y)
print("ค่า x ไม่เท่ากับกว่า y หรือไม่ :",x != y)
print("ค่า x มากกว่า หรือ เท่ากับกว่า y หรือไม่ :",x >= y)
print("ค่า x น้อยกว่า หรือ เท่ากับกว่า y หรือไม่ :",x <= y)

# print("ค่า x มากกว่า y และ y มากกว่า z หรือไม่",x>y>z)